{
  "basics": {
    "name": "Feng Sun",
    "label": "Front-end Engineer",
    "picture": "https://tvax3.sinaimg.cn/crop.85.34.857.857.180/e31913f7ly8glsg9ijxb0j20u016wtbi.jpg",
    "email": "sunfeng32@qq.com",
    "phone": "(+86)15214365796",
    "website": "https://github.com/stupidism/",
    "summary": "Great wisdom looks stupid, great skill seems clumsy. 中文简历地址: https://stupidism.github.io/resume-cn/",
    "profiles": [
      {
        "network": "Wechat",
        "username": "Stupidism",
        "url": ""
      },
      {
        "network": "Github",
        "username": "Stupidism",
        "url": "https://github.com/stupidism/"
      },
      {
        "network": "LinkedIn",
        "username": "Stupid",
        "url": "https://www.linkedin.com/in/%E9%80%A2-%E5%AD%99-819544b6/"
      }
    ]
  },
  "work": [
    {
      "company": "Jerry",
      "position": "Staff Software Engineer",
      "website": "https://www.getjerry.com/",
      "startDate": "2021-02-02",
      "summary": "As a staff front-end engineer in the SEO & Content team, I participated in the development and revamping of the getjerry.com website and internal CMS. I optimized the workflow and established component design and code standards.",
      "highlights": [
        "Led a front-end team, providing technical leadership and supporting the SEO team by building and maintaining a CMS system. Led over 4 website revamps, resulting in significant growth of Google Search Console impressions from 1M to approximately 4M within one year.",
        "Collaborated with the design team to refine the development process using a design system and component library based on the Atomic design pattern. Effectively addressed the challenge of miscommunication between engineers and designers caused by geographical and language differences.",
        "Refactored the website's code from vertical-split web-apps to component-layer-split apps and libraries in a monorepo. Resolved issues related to code sharing and simplified deployment complexities associated with vertical-split web-apps.",
        "Introduced a new code-first CMS to replace the old self-developed CMS, improving the user experience for editors and enabling a clear separation of hard-coded content and design.",
        "Implemented a 3-level content model for the section-richtext-component, addressing challenges related to page layout/templates, rich content, and component reuse in the SEO domain (similar to a no-code platform).",
        "Implemented a per-branch deployment mechanism based on Vercel to manage increasing deployment conflicts in a single-stage environment and facilitate preview links before code review for pull requests.",
        "Advocated for the adoption of TypeScript in both front-end and back-end processes, ensuring better control over data flow from input and out step without unnecessary abuse.",
        "Created and enforced a front-end code convention to ensure consistent code style across all front-end applications. The convention can be found at: https://github.com/Stupidism/stupic"
      ]
    },
    {
      "company": "Pinduoduo",
      "position": "Front-end Engineer",
      "website": "https://www.pinduoduo.com/",
      "startDate": "2020-04-03",
      "endDate": "2021-01-18",
      "summary": "Developed five front-end projects (1 in Vue, 4 in React) for three business groups as a dedicated front-end engineer in the Storage-Infra team. Also contributed to DevOps and engineering work as a member of the Admin-FE team.",
      "highlights": [
        "Took over an old data service platform that integrated storage, conversion, validation, and searching functionalities. Collaborated with the back-end team to optimize operations, reducing personnel requirements from 3 to 1. Analyzed pain points, re-identified core concepts, redesigned pages, and standardized forms.",
        "Participated in building two web apps (user-end and ops-end) from scratch for a new data-searching service platform. Contributed to requirements analysis, prototype design, data structure, API design, web app development, DevOps setup, and documentation.",
        "Developed a SQL editor based on monaco-editor, providing highlights, auto-completion, syntax validation, and metadata parsing for the SQL dialect used in the search platform.",
        "Established a monorepo within the front-end team to facilitate code sharing for DevOps tools, code generators, components, hooks, app layout, API definitions, TypeScript types, etc. Built four projects of my own and three projects from other team members.",
        "Created a TypeScript-based component code generator in the monorepo using @angular/schematics. The generator creates various types of components and API hooks, including lists, forms, modals, details, selects, and status tags.",
        "Introduced a file structure for components that separates exports, types, rendering, logic hooks, styles, and constants. This separation enhances business logic clarity, code readability, debugging, refactoring, testing, and performance, making it easier even for new graduates to write high-quality code within the framework.",
        "Developed an API hook library based on useSWR and axios-hooks, simplifying backend API calls for front-end projects. With TypeScript types, developers only need one line of code to call an API and receive the return value along with metadata.",
        "Currently involved in developing the web app for a new admin platform for ElasticSearch, which is an updated version of the ElasticSearch storage part of the old platform."
      ]
    },
    {
      "company": "WeWork",
      "position": "Software Engineer II",
      "website": "https://www.wework.cn/",
      "startDate": "2018-04-23",
      "endDate": "2020-04-01",
      "summary": "[Team1] Led a team of 4 front-end engineers at wework.cn. [Team2] Spearheaded the re-architecture of a multi-team, multi-framework CMS project.",
      "highlights": [
        "[Team1] Rebuilt wework.cn, recruited and onboarded 3 front-end engineers, and successfully led 2 major revamps. Collaborated closely with PMs to analyze requirements and delegated tasks to other front-end engineers over a span of six months.",
        "[Team2] Proposed and implemented a novel architecture utilizing a mono-repo and micro-frontend approach, effectively resolving maintenance challenges arising from diverse languages and teams.",
        "Developed and maintained a comprehensive component library comprising more than 22 business components, in close collaboration with designers.",
        "Enhanced and maintained test coverage above 95%. Implemented A/B testing methodologies and conducted multiple tests with PMs and data engineers to introduce innovative features.",
        "Designed a streamlined and traceable workflow, incorporating branch-based test links and a tag-based deployment strategy."
      ]
    },
    {
      "company": "Clarity Movement Co.",
      "position": "Front-end Engineer",
      "website": "https://clarity.io/",
      "startDate": "2016-02-16",
      "endDate": "2018-03-14",
      "summary": "Sole front-end engineer responsible for developing data virtualization websites.",
      "highlights": [
        "Utilized echarts and Google Maps to visualize air quality data. Leveraged UI libraries such as echarts, Material-UI, Bootstrap, and Antd.",
        "Designed interactive wireframe prototypes using Balsamiq for select projects.",
        "Developed multiple crawler scripts in Node.js to extract third-party AQI (Air Quality Index) data.",
        "Contributed to the open-source community by releasing a component library, a test utility, and a starter project."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "WeLunch",
      "position": "Founder",
      "startDate": "2019-05-17",
      "summary": "Founded and operated a community within the WeWork headquarters, aiming to provide affordable, healthy, and delicious lunches for all colleagues.",
      "highlights": [
        "Built a WeLunch community with approximately 220 members out of 600 employees in our headquarters, averaging about 20 orders per day.",
        "Successfully sustained the WeLunch community for over 3 years after my resignation, demonstrating its continued success and viability."
      ]
    },
    {
      "organization": "SJTU Software School Youth Volunteers",
      "position": "Vice Captain",
      "startDate": "2012-09-01",
      "endDate": "2014-07-01",
      "summary": "Participated as a volunteer and took on the role of Vice Captain, organizing various activities.",
      "highlights": [
        "Organized and conducted 'Interest Lessons' for a middle school near SJTU.",
        "Assisted elderly members of a community in resolving computer-related issues."
      ]
    }
  ],
  "education": [
    {
      "institution": "Shanghai Jiao Tong University",
      "area": "Software Engineering",
      "studyType": "Bachelor",
      "startDate": "2012-09-01",
      "endDate": "2016-07-01",
      "gpa": "3.65",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "China SSOIE Competition 2nd Prize",
      "date": "2014-09-03",
      "awarder": "MOE of China, MOC of China, Wuxi Government ",
      "summary": "Led light coded transimition. 'SSOIE' for 'Student Service Outsourcing Innovation and Entrepreneurship'"
    }
  ],
  "publications": [],
  "skills": [
    {
      "name": "Front-end Development",
      "level": "Master",
      "keywords": [
        "React",
        "TypeScript",
        "Jest",
        "Storybook",
        "styled-components",
        "antd",
        "Material-ui",
        "Contentful",
        "Vue"
      ]
    },
    {
      "name": "Front-end Architecture",
      "level": "Master",
      "keywords": [
        "Mono-repo",
        "@nrwl/nx",
        "Github Actions",
        "Webpack",
        "Babel",
        "Aliyun",
        "Micro-frontend",
        "Docker"
      ]
    },
    {
      "name": "Back-end Development",
      "level": "Advanced",
      "keywords": ["NodeJS", "Nextjs", "KoaJS", "MongoDB", "Mongoose"]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent (ILR Level 4)"
    },
    {
      "language": "Chinese",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Science Fiction",
      "keywords": ["Three Body", "Foundation"]
    },
    {
      "name": "US TV series",
      "keywords": ["Westworld", "Rick and Morty"]
    },
    {
      "name": "Politics and History",
      "keywords": [
        "The Key 100 Wars in Chinese Feudal History",
        "政事堂 Political Affairs Hall"
      ]
    }
  ],
  "references": []
}
